/*---------------------------------------------------------------------*/
/* --- STC MCU Limited ------------------------------------------------*/
/* --- STC15Fxx 系列 低压检测(LVD)中断唤醒掉电模式举例-----------------*/
/* --- Mobile: (86)13922805190 ----------------------------------------*/
/* --- Fax: 86-0513-55012956,55012947,55012969 ------------------------*/
/* --- Tel: 86-0513-55012928,55012929,55012966-------------------------*/
/* --- Web: www.STCMCU.com --------------------------------------------*/
/* --- Web: www.GXWMCU.com --------------------------------------------*/
/* 如果要在程序中使用此代码,请在程序中注明使用了STC的资料及程序        */
/* 如果要在文章中应用此代码,请在文章中注明使用了STC的资料及程序        */
/*---------------------------------------------------------------------*/

// 本示例在Keil开发环境下请选择Intel的8058芯片型号进行编译
// 若无特别说明,工作频率一般为11.0592MHz

// 注意:测试本示例时,需在ISP下载时将低压复位功能关闭

#include "../../include/stc15.h"
#include "low_v.h"
#include "eeprom.h"
#include "uart.h"
// sbit ELVD = IE ^ 6; // 低压检测中断使能位
// sbit P11 = P1 ^ 1;  // 测试口

//-----------------------------------------

// void LVD_ISR(void) __interrupt(6)
// {
//     P10 = !P10;    // 测试口
//     PCON &= ~LVDF; // 向PCON.5写0清LVD中断
// }

void LVD_Init(void)
{

    PCON &= ~LVDF; // 上电后需要清LVD中断标志位
    ELVD = 1;      // 使能LVD中断
    EA = 1;        // 打开总中断开关

    // while (1)
    // {
    //     PCON |= 0x02; // 进入掉电模式
    //     _nop_();
    //     _nop_();
    // }
}
